**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [26]:
import pandas as pd
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'], 'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no'],
       'labels': ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
           }
df=pd.DataFrame(data=data)
df.set_index('labels',inplace=True)

df.head()

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
birds       10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**3. Print the first 2 rows of the birds dataframe **

In [29]:
df.head(2)

         birds  age  visits priority
labels
a       Cranes  3.5       2      yes
b       Cranes  4.0       4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [39]:
df[['birds','age']]

             birds  age
labels
a           Cranes  3.5
b           Cranes  4.0
c          plovers  1.5
d       spoonbills  NaN
e       spoonbills  6.0
f           Cranes  3.0
g          plovers  5.5
h           Cranes  NaN
i       spoonbills  8.0
j       spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [64]:
df1=df.copy()
df1.reset_index()
df1.iloc[[1,2,6],[0,1,2]]

          birds  age  visits
labels
b        Cranes  4.0       4
c       plovers  1.5       3
g       plovers  5.5       2

**6. select the rows where the number of visits is less than 4**

In [65]:
df.loc[df['visits']<4]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
c          plovers  1.5       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [78]:
new_df=df1.fillna('Not Defined')
new_df.loc[new_df['age']=='Not Defined',['birds','visits']]

             birds  visits
labels
d       spoonbills       4
h           Cranes       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [84]:
df.loc[[df['birds']=='Cranes'] and df['age']<4]

          birds  age  visits priority
labels
a        Cranes  3.5       2      yes
c       plovers  1.5       3       no
f        Cranes  3.0       4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [94]:
df.loc[[df['age']>1 ]and df['age']<5]

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
f           Cranes  3.0       4       no
j       spoonbills  4.0       2       no

**10. Find the total number of visits of the bird Cranes**

In [114]:
Cranes_visit=df.loc[df['birds']=='Cranes',['visits']]
Cranes_visit.visits.sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [100]:
g1=df.groupby('birds')
for birds,birds_df in g1:
    print (birds)
    print (birds_df.age.mean())

Cranes
3.5
plovers
3.5
spoonbills
6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [113]:
df.loc['K']=['Eagle',8,3,'No']
print (df)
df.drop(['K'],inplace=True)
print (df)

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no
K            Eagle  8.0       3       No
             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [115]:
for birds,birds_df in g1:
    print (birds)
    print (birds_df.age.count())

Cranes
3
plovers
2
spoonbills
3

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [121]:
df_sort=df.sort_index(by='age',ascending=False)
print (df_sort)
df_sort=df_sort.sort_index(by='visits')
print (df_sort)

             birds  age  visits priority
labels
i       spoonbills  8.0       3       no
e       spoonbills  6.0       3       no
g          plovers  5.5       2       no
b           Cranes  4.0       4      yes
j       spoonbills  4.0       2       no
a           Cranes  3.5       2      yes
f           Cranes  3.0       4       no
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
h           Cranes  NaN       2      yes
             birds  age  visits priority
labels
g          plovers  5.5       2       no
j       spoonbills  4.0       2       no
a           Cranes  3.5       2      yes
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
e       spoonbills  6.0       3       no
c          plovers  1.5       3       no
b           Cranes  4.0       4      yes
f           Cranes  3.0       4       no
d       spoonbills  NaN       4      yes

C:\Users\Ankesh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """Entry point for launching an IPython kernel.
C:\Users\Ankesh\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  This is separate from the ipykernel package so we can avoid doing imports until

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [125]:
df_change=df.replace({'yes':1,'no':0})
df_change

             birds  age  visits  priority
labels
a           Cranes  3.5       2         1
b           Cranes  4.0       4         1
c          plovers  1.5       3         0
d       spoonbills  NaN       4         1
e       spoonbills  6.0       3         0
f           Cranes  3.0       4         0
g          plovers  5.5       2         0
h           Cranes  NaN       2         1
i       spoonbills  8.0       3         0
j       spoonbills  4.0       2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [143]:
df_birds=df.copy()
df_birds.replace({'Cranes':'trumpeters'},inplace=True)
df_birds

             birds  age  visits priority
labels
a       trumpeters  3.5       2      yes
b       trumpeters  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f       trumpeters  3.0       4       no
g          plovers  5.5       2       no
h       trumpeters  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no